/ *
Закомментируй ненужные строки кода, чтобы на экран вывелась надпись:
2 плюс 3 равно 5
Примечание: комментировать строку с объявлением нельзя число.
* /
// Пример комментария

public  class  Main {
    public  static  void  main ( String [] args ) {
        int a =  3 ;
        int b =  2 ;

       / * Система . из . печать ( " два " );* /
        Система . из . печать (б);
        Система . из . печать ( " плюс " );
       / * Система . из . печать ( " минус " );* /
        Система . из . печать (а);
     / *   Система . из . print ( " три " );* /
        Система . из . печать ( " равно " );
      / *  Система . из . печать ( " будет " );* /
      / *  Система . из . печать ( " пять " );* /
        Система . из . печать (а + б);
    }
}
